{
  "users": [
    {
      "id": 1,
      "name": "Sarah Maginnis",
      "email": "sarahemaginnis@gmail.com"
    },
    {
      "id": 2,
      "name": "Elle Woods",
      "email": "ellewoods@harvard.edu"
    },
    {
      "id": 3,
      "name": "Vivian Kensington",
      "email": "viviankensington@harvard.edu"
    }
  ],
  "subjects": [
    {
      "id": 1,
      "name": "Constitutional Law"
    },
    {
      "id": 2,
      "name": "Torts"
    },
    {
      "id": 3,
      "name": "Civil Procedure"
    }
  ],
  "classes": [
    {
      "id": 1,
      "subjectId": 1,
      "casebook": "Constitutional Law, 20th edition by Noah R. Feldman & Kathleen M. Sullivan"
    },
    {
      "id": 2,
      "subjectId": 2,
      "casebook": "Prosser, Wade & Schwartz on Torts"
    },
    {
      "id": 3,
      "subjectId": 3,
      "casebook": "Yeazell Civil Procedure"
    }
  ],
  "parties": [
    {
      "id": 1,
      "party": "Plaintiff"
    },
    {
      "id": 2,
      "party": "Defendant"
    },
    {
      "id": 3,
      "party": "Appellant"
    },
    {
      "id": 4,
      "party": "Appellee"
    },
    {
      "id": 5,
      "party": "Petitioner"
    },
    {
      "id": 6,
      "party": "Respondent"
    },
    {
      "id": 7,
      "party": "Amicus Curiae"
    }
  ],
  "briefs": [
    {
      "creatorId": 1,
      "id": 5,
      "classId": 2,
      "casebook": 2,
      "pageNumbers": "25-40",
      "name": "Child Who Pulled Chair Out from Under Adult",
      "court": "I forget",
      "decisionDate": "1970s",
      "citation": "",
      "partyOneRole": 1,
      "partyOneName": "Adult",
      "partyTwoRole": 2,
      "partyTwoName": "Child",
      "facts": "A minor child pulled the chair out from underneath an adult, injuring the adult. the adult sued the parents of the child and the child itself.",
      "causeOfAction": "Negligence",
      "proceduralHistory": "Procedural history is boring and for the dummies.",
      "issuesFact": "Here's a test factual issue",
      "issuesLaw": "Can a child be sued and held responsible for negilgence?",
      "holding": "Yes - reasonably prudent person of the age of the child (basically, if a normal kid of that age would have known better then they're responsible)",
      "rules": "",
      "rationale": "Reasonably prudent person standard",
      "proceduralDisposition": "",
      "concurringDissentingOpinions": "",
      "classDate": "2022-06-13",
      "classNote": "Twas boring"
    },
    {
      "creatorId": 2,
      "id": 6,
      "classId": 1,
      "casebook": 1,
      "pageNumbers": "150",
      "name": "Marbury v. Madison",
      "court": "Supreme Court",
      "decisionDate": "Feb 24, 1803",
      "citation": "5 US 137 (1803)",
      "partyOneRole": 5,
      "partyOneName": "William Marbury",
      "partyTwoRole": 6,
      "partyTwoName": "James Madison, Secretary of State",
      "facts": "Thomas Jefferson defeated John Adams in the 1800 presidential election. Before Jefferson took office on March 4, 1801, Adams and Congress passed the Judiciary Act of 1801, which created new courts, added judges, and gave the president more control over appointment of judges. The Act was essentially an attempt by Adams and his party to frustrate his successor, as he used the act to appoint 16 new circuit judges and 42 new justices of the peace. The appointees were approved by the Senate, but they would not be valid until their commissions were delivered by the Secretary of State. \n\nWilliam Marbury had been appointed Justice of the Peace in the District of Columbia, but his commission was not delivered. Marbury petitioned the Supreme Court to compel the new Secretary of State, James Madison, to deliver the documents. Marbury, joined by three other similarly situated appointees, petitioned for a writ of mandamus compelling the delivery of the commissions. ",
      "causeOfAction": "",
      "proceduralHistory": "",
      "issuesFact": "",
      "issuesLaw": "Do the plaintiffs have a right to receive their commissions?\nCan they sue for their commissions in court?\nDoes the Supreme Court have the authority to order the delivery of their commissions?",
      "holding": "Majority Opinion by John Marshall\nThough Marbury was entitled to it, the Court was unable to grant it because Section 13 of the Judiciary Act of 1789 conflicted with Article III section 2 of the U.S. Constitution and was therefore null and void.",
      "rules": "Marshall established the principle of judicial review, i.e., the power to declare a law unconstitutional. \n\nThe Supreme Court of the United States (Supreme Court) has constitutional authority to review executive actions and legislative acts. The Supreme Court has limited jurisdiction, the bounds of which are set by the United States Constitution (Constitution), which may not be enlarged by the Congress.",
      "rationale": "The Court found that Madison’s refusal to deliver the commission was illegal, but did not order Madison to hand over Marbury’s commission via writ of mandamus. Instead, the Court held that the provision of the Judiciary Act of 1789 enabling Marbury to bring his claim to the Supreme Court was itself unconstitutional, since it purported to extend the Court’s original jurisdiction beyond that which Article III, Section 2, established. \n\nMarshall expanded that a writ of mandamus was the proper way to seek a remedy, but concluded the Court could not issue it. Marshall reasoned that the Judiciary Act of 1789 conflicted with the Constitution. Congress did not have power to modify the Constitution through regular legislation because Supremacy Clause places the Constitution before the laws. \n\nIn so holding, Marshall established the principle of judicial review, i.e., the power to declare a law unconstitutional. ",
      "proceduralDisposition": "Unanimous decision for Marbury, case dismissed for want of jurisdiction.",
      "concurringDissentingOpinions": "",
      "classDate": "2022-06-20",
      "classNote": "The importance of Marbury v. Madison is both political and legal. Although the case establishes the traditions of judicial review and a litigable constitution on which the remainder of constitutional law rests, it also transformed the Supreme Court from an incongruous institution to an equipotent head of a branch of the federal government."
    },
    {
      "creatorId": 2,
      "classId": 1,
      "casebook": 1,
      "pageNumbers": "175",
      "name": "New York City Transit Authority v. Beazer",
      "court": "Supreme Court",
      "decisionDate": "1979",
      "citation": "440 U.S. 568",
      "partyOneRole": 5,
      "partyOneName": "New York City Transit Authority",
      "partyTwoRole": 6,
      "partyTwoName": "Beazer",
      "facts": "he Petitioner, New York City Transit Authority (Petitioner), refuses to employ methadone users. The Respondent, Beazer (Respondent), brings suit on behalf of all methadone users who might work for Petitioner under the auspice that the policy violates the Equal Protection Clause of the United States Constitution (Constitution).\n\nRespondent applied for a job with Petitioner and was denied because he was being treated for a drug addiction with methadone. This treatment is an effective cure for the addiction, but still has a high failure rate, exceeding 25%.",
      "causeOfAction": "Equal Protection Clause",
      "proceduralHistory": "",
      "issuesFact": "",
      "issuesLaw": "Does Petitioner’s hiring policy violate the Equal Protection Clause by refusing employment to methadone users?",
      "holding": "No. The special classification created by Petitioner's rule serves the general objective of safety and efficiency.",
      "rules": "A rule will violate the Equal Protection clause of the Constitution if it circumscribes a class of persons according an unpopular trait or affiliation.\n\nA suspect class is a class of persons characterized by some unpopular trait or affiliation that would reflect any spec...",
      "rationale": "",
      "proceduralDisposition": "",
      "concurringDissentingOpinions": "Dissent: It is improper to classify those who are on methadone treatment as a drug user. This discriminates against them as potential employees, when they no longer have the same traits as active users.",
      "classDate": "2022-06-09",
      "classNote": "The majority indicates that just because a rule may create sub-classifications that are not as closely connected to achieving the legitimate interest, this does not invalidate the entire rule. The Petitioner has a legitimate interest in the safety of the services provided, even though the available positions may have had no safety responsibility, the majority is reluctant to impose judicial judgment over that of the business’ management.",
      "id": 7
    },
    {
      "creatorId": 2,
      "id": 8,
      "classId": 2,
      "casebook": 2,
      "pageNumbers": "165",
      "name": "Gulf Refining Co. v. Williams",
      "court": "",
      "decisionDate": "1935",
      "citation": "",
      "partyOneRole": 1,
      "partyOneName": "Williams",
      "partyTwoRole": 2,
      "partyTwoName": "Gulf Refining Co.",
      "facts": "Plaintiff was injured after a gasoline container delivered by Defendant exploded while he was trying to remove its cap. The explosion occurred as a result of a spark caused by worn threads on the cap. Plaintiff sued to recover for his personal injuries.\n\nThe Defendant delivered a gasoline container to Plaintiff for use in refueling a tractor. The container had been in use for about nine years and was in a state of considerable disrepair. When Plaintiff went to refuel the tractor, he removed the container’s cap and the gasoline exploded, causing him great injury. The jury found Defendant liable for Plaintiff’s injuries. Defendant appealed, arguing that the explosion was so unusual, extraordinary, and unforeseeable that they cannot be held liable for damages resulting from its occurrence.",
      "causeOfAction": "Negligence",
      "proceduralHistory": "",
      "issuesFact": "",
      "issuesLaw": "Was the damage inflicted upon Plaintiff foreseeable so as to give rise to a claim for negligence based upon the failure to take steps to safeguard against it?",
      "holding": "Yes. The judgment was affirmed. The state of the gasoline container, as was known to Defendant, was such that a reasonable person should have anticipated that its disrepair could cause an explosion and thus should have taken care to safeguard against such a result. Defendant’s failure to do so subjected it to liability.",
      "rules": "Foreseeability of a harm is the existence of such a likelihood of damage so as to induce action to take care against it on the part of a reasonably prudent person.",
      "rationale": "",
      "proceduralDisposition": "",
      "concurringDissentingOpinions": "",
      "classDate": "2022-05-17",
      "classNote": "This case attempts to define the concept of foreseeability. As the Court explains, such foreseeability as can give rise to negligence can be found when there exists sufficient likelihood of damage to induce a reasonably prudent person to take care against it."
    }
  ],
  "messages": [
    {
      "creatorId": 1,
      "name": "Sarah Maginnis",
      "email": "sarahemaginnis@gmail.com",
      "message": "This is a test message!",
      "id": 1
    }
  ]
}